docs/roadmap-1.20.org
#+TITLE: APISnoop 1.20 OKRs
#+AUTHOR: ii.coop

* v1.20 
  Our goal is to not make radical changes to process or approach, but iterate on our working methods to increase velocity and output in a stable, consistent way.
** Raw Progress
#+REVEAL_HTML: <div style="font-size: 60%;">
|          |   1.14 |   1.15 |   1.16 |   1.17 |   1.18 |   1.19 |   1.20 |
|----------+--------+--------+--------+--------+--------+--------+--------|
| Tested   |     76 |    116 |    156 |    153 |    230 |    249 |    265 |
| Untested |    280 |    266 |    240 |    230 |    195 |    175 |    153 |
| Total    |    356 |    382 |    396 |    383 |    425 |    424 |    418 |
| Cover    | 21.35% | 30.37% | 39.39% | 39.95% | 54.12% | 58.73% | 63.40% |
#+REVEAL_HTML: </div>
** **Final update for 1.20**
   Test Freeze is here, time for our final results!
** **Increase Stable Test Coverage**
*** **KR1 increase new conformant stable endpoints**
- Goal: 30   - Stretch Goal: 40
- Status +26 (Merged):
  - [[https://github.com/kubernetes/kubernetes/pull/95713][+7 ReplicationController]]
  - [[https://github.com/kubernetes/kubernetes/pull/96485][+3 Pod+PodStatus Lifecycle]]
  - [[https://github.com/kubernetes/kubernetes/pull/96487][+5 AppV1Deployment Lifecycle]]
  - [[https://github.com/kubernetes/kubernetes/pull/95884][+5 PriorityClass endpoints]]
  - [[https://github.com/kubernetes/kubernetes/pull/92813][+1 delete/CollectionNamespacedEvent]]
  - [[https://github.com/kubernetes/kubernetes/pull/89753][+5 Event resource lifecycle]]
*** **Other Conformance news**
  - 8 [[https://github.com/kubernetes/enhancements/issues/585#issuecomment-730597609][New Endpoints promoted to GA]]
    - [[https://apisnoop.cncf.io/conformance-progress/endpoints/1.20.0?filter=promotedWithTests][with conformance tests!]]
  - 13 NodeProxy endpoints
    - [[https://apisnoop.cncf.io/conformance-progress/ineligible-endpoints][Marked as ineligible for conformance]]
    - Based on community feedback
*** **Greater effort after 60%**
- Getting harder to reach our objectives:
  - lot of deflaking
  - policy changes
  - upstream bugs fixed
  - new images built
  - more community interaction / latency
- The remaining endpoints for conformance
  - are taking more effort
- We have X tests currenly blocked due
  - to bugs
  - changes required
*** **KR2 clean-up technical debt**
- Goal: Clear debt back to 1.15
- Stretch Goal: Clear debt to 1.14
- Actualized: [[https://apisnoop.cncf.io/conformance-progress#coverage-by-release][Cleared back to 1.11!]]
**Over a year of Technical Debt erased!**
** **Release Blocking k/k Job**
*** **Progress**
- Our job [[https://github.com/kubernetes/test-infra/pull/19173][k/test-infra#19173]]
  - is runnig on [[https://prow.k8s.io/?job=apisnoop-conformance-gate][prow.k8s.io]]
  - is catching untested new endpoints
  - is gaining community [[https://github.com/kubernetes/kubernetes/issues/96524][traction]]
  - [[https://prow.k8s.io/?job=apisnoop-conformance-gate][apisnoop-conformance-gate]]
- further automation is in progress
** **Other Important News**
*** **Timeline**
- 1.20 was a short cycle
  - Test freeze 23 November 2020
  - Code freeze 12 November 2020
  - Release date 8 December 2020
- 1.21 [[https://hackmd.io/@1ZEI8TYqTDWogQGLAiExjw/ry-m4YYcP][still under discussion]]
*** **Conformance Gate**
- cncf/k8s-conformance gate is running
  - Looks [[https://github.com/cncf/k8s-conformance/pulls?q=is%3Apr+is%3Aclosed][like it's working]]
  - Feedback from [[https://github.com/taylorwaggoner][Taylor Waggoner]] welcome
** **1.20 Conclusions**
- No new techical debt was allowed!
- Technical debt cleared back to 1.11
- +34 new conformant Endpoints!
- +13 newly ineligible for conformance
- ~9% eligible coverage increase
  - 1.19: ~54%
  - 1.20: ~63%
** **Looking forward to 1.21**
- No radical changes
- Keep same goals as 1.20
- Know that Endpoints get tougher
*** **KR1 +30 newly conformant stable endpoints**
In spite of increasing technical challenges:
 - +30 old endpoints with new coverage
 - +40 stretch goal
*** **KR2 clean-up 1.11 and 1.10 technical debt**
6 months of debt to erase!
- 1.11
  - **+2: {read,patch}ApiregistrationStatus**
- 1.10
  - **+5: {replace,patch,list,...}Apiregistration**
** **Questions / Feedback**
In what other ways can we support the CNCF?

* Footnotes

#+REVEAL_ROOT: https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2
# #+REVEAL_TITLE_SLIDE:
#+NOREVEAL_DEFAULT_FRAG_STYLE: YY
#+NOREVEAL_EXTRA_CSS: YY
#+NOREVEAL_EXTRA_JS: YY
#+REVEAL_HLEVEL: 2
#+REVEAL_MARGIN: 0.1
#+REVEAL_WIDTH: 1000
#+REVEAL_HEIGHT: 600
#+REVEAL_MAX_SCALE: 3.5
#+REVEAL_MIN_SCALE: 1.0
#+REVEAL_PLUGINS: (markdown notes highlight multiplex)
#+REVEAL_SLIDE_NUMBER: ""
#+REVEAL_SPEED: 1
#+REVEAL_THEME: sky
#+REVEAL_THEME_OPTIONS: beige|black|blood|league|moon|night|serif|simple|sky|solarized|white
#+REVEAL_TRANS: cube
#+REVEAL_TRANS_OPTIONS: none|cube|fade|concave|convex|page|slide|zoom

#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: mathjax:Y
#+OPTIONS: reveal_single_file:nil
#+OPTIONS: reveal_control:t
#+OPTIONS: reveal-progress:t
#+OPTIONS: reveal_history:nil
#+OPTIONS: reveal_center:t
#+OPTIONS: reveal_rolling_links:nil
#+OPTIONS: reveal_keyboard:t
#+OPTIONS: reveal_overview:t
