docs/roadmap-1.20.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>APISnoop 1.20 OKRs</title>
<meta name="author" content="ii.coop"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/css/theme/sky.css" id="theme"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/css/zenburn.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">APISnoop 1.20 OKRs</h1><h2 class="author">ii.coop</h2><p class="date">Created: 2020-12-01 Tue 13:50</p>
</section>

<section>
<section id="slide-orga0d8da9">
<h2 id="orga0d8da9">v1.20</h2>
<p>
Our goal is to not make radical changes to process or approach, but iterate on our working methods to increase velocity and output in a stable, consistent way.
</p>
</section>
</section>
<section>
<section id="slide-org01cd00c">
<h3 id="org01cd00c">Raw Progress from <a href="https://apisnoop.cncf.io/">APISnoop</a></h3>
<div style="font-size: 60%;">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">1.14</th>
<th scope="col" class="org-right">1.15</th>
<th scope="col" class="org-right">1.16</th>
<th scope="col" class="org-right">1.17</th>
<th scope="col" class="org-right">1.18</th>
<th scope="col" class="org-right">1.19</th>
<th scope="col" class="org-right">1.20</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tested</td>
<td class="org-right">68</td>
<td class="org-right">75</td>
<td class="org-right">116</td>
<td class="org-right">143</td>
<td class="org-right">153</td>
<td class="org-right">231</td>
<td class="org-right">263</td>
</tr>

<tr>
<td class="org-left">Untested</td>
<td class="org-right">274</td>
<td class="org-right">267</td>
<td class="org-right">253</td>
<td class="org-right">226</td>
<td class="org-right">216</td>
<td class="org-right">179</td>
<td class="org-right">155</td>
</tr>

<tr>
<td class="org-left">Total</td>
<td class="org-right">342</td>
<td class="org-right">342</td>
<td class="org-right">369</td>
<td class="org-right">369</td>
<td class="org-right">369</td>
<td class="org-right">410</td>
<td class="org-right">418</td>
</tr>

<tr>
<td class="org-left">Cover</td>
<td class="org-right">19.88%</td>
<td class="org-right">21.93%</td>
<td class="org-right">31.44%</td>
<td class="org-right">38.75%</td>
<td class="org-right">41.46%</td>
<td class="org-right">56.34%</td>
<td class="org-right">62.92%</td>
</tr>
</tbody>
</table>
</div>
</section>
</section>
<section>
<section id="slide-org033f94a">
<h3 id="org033f94a"><b><b>Final update for 1.20</b></b></h3>
<p>
Test Freeze is here, time for our final results!
</p>
</section>
</section>
<section>
<section id="slide-org60ef11f">
<h3 id="org60ef11f"><b><b>Increase Stable Test Coverage</b></b></h3>
<div class="outline-text-3" id="text-org60ef11f">
</div>
</section>
<section id="slide-org80ff97d">
<h4 id="org80ff97d"><b><b>KR1 increase new conformant stable endpoints</b></b></h4>
<ul>
<li>Goal: 30   - Stretch Goal: 40</li>
<li>Status +24 (Merged):
<ul>
<li><a href="https://github.com/kubernetes/kubernetes/pull/95713">+7 ReplicationController</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/96485">+1 Pod+PodStatus Lifecycle</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/96487">+5 AppV1Deployment Lifecycle</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/95884">+5 PriorityClass endpoints</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/92813">+1 delete/CollectionNamespacedEvent</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/89753">+5 Event resource lifecycle</a></li>

</ul></li>

</ul>
</section>
<section id="slide-org8e8b21e">
<h4 id="org8e8b21e"><b><b>Other Conformance news</b></b></h4>
<ul>
<li>8 <a href="https://github.com/kubernetes/enhancements/issues/585#issuecomment-730597609">New Endpoints promoted to GA</a>
<ul>
<li><a href="https://apisnoop.cncf.io/conformance-progress/endpoints/1.20.0?filter=promotedWithTests">with conformance tests!</a></li>

</ul></li>
<li>13 NodeProxy endpoints
<ul>
<li><a href="https://apisnoop.cncf.io/conformance-progress/ineligible-endpoints">Marked as ineligible for conformance</a></li>
<li>Based on <a href="https://github.com/kubernetes/kubernetes/issues/95930">community feedback</a></li>

</ul></li>

</ul>
</section>
<section id="slide-org899e1bb">
<h4 id="org899e1bb"><b><b>Greater effort after 60%</b></b></h4>
<ul>
<li>Getting harder to reach our objectives:
<ul>
<li><a href="https://github.com/kubernetes/kubernetes/issues/95920">lots</a> <a href="https://github.com/kubernetes/kubernetes/pull/96485">of</a> <a href="https://github.com/kubernetes/kubernetes/pull/96487">deflaking</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/95388">policy changes</a></li>
<li><a href="https://github.com/kubernetes/kubernetes/pull/95128">upstream</a> <a href="https://github.com/kubernetes/kubernetes/issues/95129">bugs</a> <a href="https://github.com/kubernetes/kubernetes/issues/95966">fixed</a></li>
<li>new <a href="https://prow.k8s.io/job-history/gs/kubernetes-jenkins/logs/post-kubernetes-push-e2e-test-images">images</a> <a href="https://github.com/kubernetes/kubernetes/pull/95503#issuecomment-723488612">built</a></li>
<li>more community <a href="https://github.com/kubernetes/kubernetes/pull/95781">interaction</a> / <a href="https://github.com/kubernetes/kubernetes/pull/94786#issuecomment-707372603">latency</a></li>

</ul></li>
<li>The remaining endpoints for conformance
<ul>
<li>are taking more effort</li>

</ul></li>

</ul>
</section>
<section id="slide-org4f26efa">
<h4 id="org4f26efa"><b><b>KR2 clean-up technical debt</b></b></h4>
<ul>
<li>Goal: Clear debt back to 1.15</li>
<li>Stretch Goal: Clear debt to 1.14</li>
<li>Actualized: <a href="https://apisnoop.cncf.io/conformance-progress#coverage-by-release">Cleared back to 1.11!</a></li>

</ul>
<p>
<b><b>Over a year of Technical Debt erased!</b></b>
</p>
</section>
</section>
<section>
<section id="slide-orgebe86b4">
<h3 id="orgebe86b4"><b><b>Release Blocking k/k Job</b></b></h3>
<div class="outline-text-3" id="text-orgebe86b4">
</div>
</section>
<section id="slide-org50d9d14">
<h4 id="org50d9d14"><b><b>Progress</b></b></h4>
<ul>
<li>Our job <a href="https://github.com/kubernetes/test-infra/pull/19173">k/test-infra#19173</a>
<ul>
<li>is runnig on <a href="https://prow.k8s.io/?job=apisnoop-conformance-gate">prow.k8s.io</a></li>
<li>is catching untested new endpoints</li>
<li>is gaining community <a href="https://github.com/kubernetes/kubernetes/issues/96524">traction</a></li>
<li><a href="https://prow.k8s.io/?job=apisnoop-conformance-gate">apisnoop-conformance-gate</a></li>

</ul></li>
<li>further automation is in progress</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8bad269">
<h3 id="org8bad269"><b><b>Other Important News</b></b></h3>
<div class="outline-text-3" id="text-org8bad269">
</div>
</section>
<section id="slide-org4d9be27">
<h4 id="org4d9be27"><b><b>Timelines</b></b></h4>
<ul>
<li><a href="https://github.com/kubernetes/sig-release/tree/master/releases/release-1.20#timeline">1.20</a> was a short cycle
<ul>
<li>Test freeze 23 November 2020</li>
<li>Code freeze 12 November 2020</li>
<li>Release date 8 December 2020</li>

</ul></li>
<li>1.21 <a href="https://hackmd.io/@1ZEI8TYqTDWogQGLAiExjw/ry-m4YYcP">still under discussion</a></li>

</ul>
</section>
<section id="slide-org0007bb3">
<h4 id="org0007bb3"><b><b>Conformance Gate</b></b></h4>
<ul>
<li>cncf/k8s-conformance gate is running
<ul>
<li>Looks <a href="https://github.com/cncf/k8s-conformance/pulls?q=is%3Apr+is%3Aclosed">like it's working</a></li>
<li>Feedback from <a href="https://github.com/taylorwaggoner">Taylor Waggoner</a> welcome</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org6d01b45">
<h3 id="org6d01b45"><b><b>1.20 Conclusions</b></b></h3>
<ul>
<li>No new techical debt was allowed!</li>
<li>Technical debt cleared back to 1.11</li>
<li>+32 new conformant Endpoints!</li>
<li>+13 newly ineligible for conformance</li>
<li>~9% eligible coverage increase
<ul>
<li>1.19: ~54%</li>
<li>1.20: ~63%</li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-org1959a5c">
<h3 id="org1959a5c"><b><b>Looking forward to 1.21</b></b></h3>
<ul>
<li>No radical changes</li>
<li>Keep same goals as 1.20</li>
<li>Know that Endpoints get tougher</li>

</ul>
</section>
<section id="slide-org0fcb554">
<h4 id="org0fcb554"><b><b>KR1 +30 newly conformant stable endpoints</b></b></h4>
<p>
In spite of increasing technical challenges:
</p>
<ul>
<li>+30 old endpoints with new coverage</li>
<li>+40 stretch goal</li>

</ul>
</section>
<section id="slide-org88941e7">
<h4 id="org88941e7"><b><b>KR2 clean-up 1.11 and 1.10 technical debt</b></b></h4>
<p>
6 months of debt to erase!
</p>
<ul>
<li>1.11
<ul>
<li><b><b>+2: {read,patch}ApiregistrationStatus</b></b></li>

</ul></li>
<li>1.10
<ul>
<li><b><b>+5: {replace,patch,list,&#x2026;}Apiregistration</b></b></li>

</ul></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgf00205c">
<h3 id="orgf00205c"><b><b>Questions / Feedback</b></b></h3>
<p>
In what other ways can we support the CNCF?
</p>
</div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/lib/js/head.min.js"></script>
<script src="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/js/reveal.js"></script>
<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
mouseWheel: false,
fragmentInURL: false,
hashOneBasedIndex: false,
pdfSeparateFragments: true,

overview: true,
margin: 0.10,
minScale: 1.00,
maxScale: 3.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'cube', // see README of reveal.js for options
transitionSpeed: '1',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: 'https://reveal-js-multiplex-ccjbegmaii.now.sh' // Location of socket.io server
},

// Optional libraries used to extend reveal.js
dependencies: [
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://cdn.socket.io/socket.io-1.3.5.js', async: true },
 { src: 'https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.9.2/plugin/multiplex/master.js', async: true }]

});
</script>
</body>
</html>
